{
  "architectures": [
    "ElectraForPreTraining"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 100,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 200,
  "initializer_range": 0.02,
  "intermediate_size": 400,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 513,
  "model_type": "electra",
  "num_attention_heads": 5,
  "num_hidden_layers": 5,
  "pad_token_id": 0,
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "type_vocab_size": 2,
  "vocab_size": 26729
}
